'''
Найти по заданному x s=1+1/x+1/x**2+...+1/x**10
'''
x=int(input('Введите значение x '))
s=0
for i in range (11):
    s1=1/x**i
    s=s+s1
    
'''
x=1, то s=11
x=2, то s=1.9990234375
'''

print(s)
